package com.meerim.akchamanager.activities;

import android.os.Bundle;
import android.text.method.LinkMovementMethod;
import android.text.util.Linkify;

import androidx.appcompat.app.AppCompatActivity;

import com.meerim.akchamanager.databinding.ActivityArticleBinding;

import java.util.HashMap;

public class ArticleActivity extends AppCompatActivity {

    ActivityArticleBinding binding;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);

        binding = ActivityArticleBinding.inflate(getLayoutInflater());
        setContentView(binding.getRoot());

        String ctx = getIntent().getStringExtra("ctx");

        HashMap<String, String[]> articleDataMap = new HashMap<>();
        articleDataMap.put("0", new String[]{"Акча деген эмне?", "Акча – мыйзамдуу төлөм каражаты, жарандык укук объектилеринин бири. Акчанын негизги өзгөчөлүгү алар бүтүндөй жалпы эквивалент катары өзү менен кайтарымдуу мүнөзгө эгедер дээрлик баардык мүлктүк мамилелерди алмаштыра алат. Жарандык укукта акча баалуу кагаздар сыяктуу эле тектеш, алмаштырылуучу буюм түрлөрү катары таанылат. Экономикада акчанын төрт түрү бар: товардык, камсыздалган, фияттык жана кредиттик. Учурда заманбап акчалардын баардыгы фияттык акчаларга негизделген.", "https://tyup.net/page/akcha-degen-emne"});
        articleDataMap.put("1", new String[]{"Акча үнөмдөөнүн жеңил 7 ыкмасы", "Киреше жетпегенине наалыгандар арабызда аз эмес. Дагы беш миң болгондо баарына жетмек деп кейип калабыз, ал тургай айрым учурда муну ачык эле кыялданып да калабыз. Ошол жетпей калган каражат капчыгыңызда болушу мүмкүн, анын сырларын издеп көрөлү. \n" +
                "\n" + "1.Кийим-кечени сезон соңунда сатып алыңыз \n" +
                "\n" + "2.Арзандатуу карталарын пайдаланыңыз \n" +
                "\n" + "3.Азык-түлүктү акыл калчап алыңыз \n" +
                "\n" + "4.Ашыкча буюмдун баарын сатыңыз \n" +
                "\n" + "5.Жумушка үйдөн тамак алып барыңыз \n" +
                "\n" + "6.Даңкына азгырылбаңыз \n" +
                "\n" + "7.Сапатка басым жасаңыз", "https://sputnik.kg/20211212/akcha-unomdoonun-ykmasy-1054864922.html"});
        articleDataMap.put("2", new String[]{"Кредит деген эмне? Кандай колдонуу керек?", "Банк же башка финансы-кредит уюму карыз алуучуга ар кандай максаттарга убактылуу пайдаланууга сунуштаган акча каражатынын суммасын кредит деп түшүнүү зарыл. Банк берген сумма негизги сумма болуп эсептелинет, ал эми аны пайдадалангандыгы үчүн пайыздар төлөнүп берилиши зарыл. Көпчүлүк учурда айрым бир операция мисалы, кредитке берилген акча каражатын нак акчага айландыруу үчүн комиссиялык төлөмдү төлөөгө туура келет. Кредиттин негизги суммасы, ага кошуп эсептелинген пайыздар жана комиссиялык төлөмдөр  кредиттик келишим мөөнөтү ичинде кайтарылууга тийиш. Кредит суммасы канчалык кеч кайтарылган болсо, ошончо көбүрөөк пайыз төлөөгө туура келет.", "https://finsabat.kg/ky/credits-debts/credits-debts-articles/83"});
        articleDataMap.put("3", new String[]{"Улуттук банктын максаттары жана милдеттери", "Кыргыз Республикасынын Улуттук банкынын ишинин башкы максаты болуп тиешелүү акча-кредит саясатын жүргүзүү аркылуу баалардын туруктуулугун жетишүү жана аны колдоп туруу саналат. \n" +
                "\n" +
                "Банктын ишинин максаттарына жетишүүгө өбөлгө түзгөн негизги милдет - улуттук валютанын сатып алуу жөндөмдүүлүгүн колдоо, республиканын банк жана төлөө системаларынын коопсуздугун жана ишенимдүү ишин камсыз кылуу. \n" +
                "\n" +
                "Кыргыз Республикасынын Улуттук банкы алдына койгон милдеттерди аткаруу үчүн өз ишин мамлекеттик бийлик жана башкаруу органдарынан көз карандысыз, өз алдынча уюштурат жана жүзөгө ашырат. Кыргыз Республикасынын Улуттук банкы төмөндөгү функцияларды аткарат: \n" +
                "\n" +
                "1. Кыргыз Республикасында акча-кредит саясатын иштеп чыгат, аныктайт жана жүргүзөт.; \n" +
                "\n" +
                "2. Кыргыз Республикасынын Улуттук банкынан лицензия алган банктардын жана финансы-кредиттик мекемелердин ишин жөнгө салат жана ага көзөмөлдүктү жүзөгө ашырат; \n" +
                "\n" +
                "3. бирдиктүү валюта саясатын иштеп чыгат жана жүзөгө ашырат; \n" +
                "\n" +
                "4. акча белгилеринин эмиссиясын жүзөгө ашырууга өзгөчө укукка ээ; \n" +
                "\n" +
                "5. төлөө системаларынын натыйжалуу иштөөсүнө көмөктөшөт;", "https://www.nbkr.kg/index1.jsp?item=2&lang=KGZ"});
        articleDataMap.put("4", new String[]{"Инвестиция деген эмне?", "Инвестиция – бул белгилүү бир убакыт ичинде нарктын өсүшүнө жетүү үчүн активдин арналышы. Инвестиция убакыт, акча же күч сыяктуу колдогу активдерди курмандыкка чалууну талап кылат. Каржы тармагында инвестирлөөнүн максаты жумшалган активден киреше табуу болуп саналат. Жооп(инвестиңиянын рентабелүдүүлүгү, англ. ROI) мүлктү, инвестицияларды сатуудагы кирешеден(пайдадан) же жоготуудан, же капиталдын ишке ашпаган киреше өсүүсүнөн(б.а амортизация), же дивиденддер, проценттик пайдалар же ижара кирешеси сыяктуу инвестициялык кирешелерден, же капиталдын өсүүсү(capital gain) менен кирешенин комбинациясынан турушу мүмкүн.", "https://kontentchi.com/investicziya-degen-emne/"});
        articleDataMap.put("5", new String[]{"10 каржылык адаттар", "Каржылык адаттар, өзүнөмдөрүмүздүн бизге ар маанени болгон адаттарды куралдайт. Бул адаттар аркылуу биз ашар катышууларды жана мүлкөмөттү баарынан таштоо укуктарымызды түзөтө алабыз. 10 каржылык адаттар: \n" +
                "Төлөмдөрүнү чыгарууларга карата жазып коюу: Жеке финанс тилкеси жасаңыз жана бардыгынан эчте жана чыгарууга чоң түшүнүүгө ишенсеңиз болот.\n" +
                "Каржылыкты башкаруу үчүн бюджеттерди пландаштыр: Өзүңүз үчүн сапаттанган бюджеттин үстүндө болууга байланышат.\n" +
                "Жылдын биринчи күнүндө үй бюджетин жаса: Айылдаманы коюу үчүн бюджеттин алдын ала пландаштыр.\n" +
                "Түзүүлөрдө кайрыланбай баштыгыңыз: Каржылыкты башкаруу үчүн эрежелерди белгилөө.\n" +
                "Каталык кошумчаны коюу: Каржылык эмес айылдамаларды кошуу жана кайрылануу.\n" +
                "Чаны каржылыкты баарынан таштоо: Жакшы каржылык эмес эсептин жардамы менен бюджеттин баарынан таштап алат.\n" +
                "Каржылыктан андан өзүңүздү тез айылдама жоктуруу: Өзүңүзгө каржылыктын алдын алуу үчүн биринчи бөлүмдө кайрыланылат.\n" +
                "Түзүмдөрдө жардам берүү: Түзүмдөргө кайра жардам берүү жана өзүңүздү кошуп, өзүңүзгө каржылыкты жаңыртып алуу.\n" +
                "Жаңырыктарга акыркы жүзөк: Каржылыкты башкаруу үчүн баштапкы маалыматтар менен акыркы жүзөктүн ичинде барып, жаңырыктарга орто арада үйрөнүү.\n" +
                "Колдонмолорду тездетүү: Каржылыкты башкаруу үчүн айылдамаларыңызды көп колдонуңуз жана эле кандай бир боюнча эле кандай кайсы бир каржылыктан айырып өтө боло албайсыз.", "https://trends.rbc.ru/trends/social/5fa452449a7947a4f4dd6a5c"});
        articleDataMap.put("6", new String[]{"Жаштар үчүн финансылык билимдин маанилүүлүгү", "Күндөлүк негизде кабыл алган чечимдериңиздин көбү каржыңызга түз же кыйыр түрдө таасирин тийгизет. Ошондуктан, каржылык билим сиздин экономикалык туруктуулугуңузга жана ошону менен бирге келечектеги пландарыңызга коркунуч келтирген тобокелчиликтердин алдын алууга жардам берет. Экономикалык жана каржылык билим акчаны жакшыраак башкарууга жана финансылык варианттарды жакшыраак түшүнүүгө үйрөтөт, бул адамдардын жыргалчылыгына жана жашоо сапатына түздөн-түз таасирин тийгизет.", "https://trends.rbc.ru/trends/social/5fa452449a7947a4f4dd6a5c"});

        String[] articleData = articleDataMap.get(ctx);
        if (articleData != null) {
            binding.txtTitleArticle.setText(articleData[0]);
            String bodyText = articleData[1];
            String originalSourceUrl = articleData[2];
            String fullText = bodyText + "\n\nМаалымат алынган шилтеме: " + originalSourceUrl;
            binding.txtBodyArticle.setText(fullText);
            Linkify.addLinks(binding.txtBodyArticle, Linkify.WEB_URLS);
            binding.txtBodyArticle.setMovementMethod(LinkMovementMethod.getInstance());
        }
    }
}